junkreef/F280025C_LP_IndependentStudy_DRV8434S/F280025C_LP_IndependentStudy_DRV8434S/driverlib/inc/hw_clbxbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG2MUX16TO31CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG2MUX16TO31CFG_MUX16_S   0U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX16_M   0x3U          // MUX16 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX17_S   2U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX17_M   0xCU          // MUX17 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX18_S   4U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX18_M   0x30U         // MUX18 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX19_S   6U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX19_M   0xC0U         // MUX19 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX20_S   8U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX20_M   0x300U        // MUX20 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX21_S   10U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX21_M   0xC00U        // MUX21 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX22_S   12U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX22_M   0x3000U       // MUX22 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX23_S   14U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX23_M   0xC000U       // MUX23 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX24_S   16U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX24_M   0x30000U      // MUX24 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX25_S   18U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX25_M   0xC0000U      // MUX25 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX26_S   20U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX26_M   0x300000U     // MUX26 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX27_S   22U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX27_M   0xC00000U     // MUX27 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX28_S   24U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX28_M   0x3000000U    // MUX28 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX29_S   26U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX29_M   0xC000000U    // MUX29 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX30_S   28U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX30_M   0x30000000U   // MUX30 Configuration for AUXSIG2 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG2MUX16TO31CFG_MUX31_S   30U
#define XBAR_AUXSIG2MUX16TO31CFG_MUX31_M   0xC0000000U   // MUX31 Configuration for AUXSIG2 of
                                                         // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG3MUX0TO15CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG3MUX0TO15CFG_MUX0_S    0U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX0_M    0x3U          // MUX0 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX1_S    2U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX1_M    0xCU          // MUX1 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX2_S    4U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX2_M    0x30U         // MUX2 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX3_S    6U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX3_M    0xC0U         // MUX3 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX4_S    8U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX4_M    0x300U        // MUX4 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX5_S    10U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX5_M    0xC00U        // MUX5 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX6_S    12U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX6_M    0x3000U       // MUX6 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX7_S    14U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX7_M    0xC000U       // MUX7 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX8_S    16U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX8_M    0x30000U      // MUX8 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX9_S    18U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX9_M    0xC0000U      // MUX9 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX10_S   20U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX10_M   0x300000U     // MUX10 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX11_S   22U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX11_M   0xC00000U     // MUX11 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX12_S   24U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX12_M   0x3000000U    // MUX12 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX13_S   26U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX13_M   0xC000000U    // MUX13 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX14_S   28U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX14_M   0x30000000U   // MUX14 Configuration for AUXSIG3 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG3MUX0TO15CFG_MUX15_S   30U
#define XBAR_AUXSIG3MUX0TO15CFG_MUX15_M   0xC0000000U   // MUX15 Configuration for AUXSIG3 of
                                                        // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG3MUX16TO31CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG3MUX16TO31CFG_MUX16_S   0U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX16_M   0x3U          // MUX16 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX17_S   2U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX17_M   0xCU          // MUX17 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX18_S   4U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX18_M   0x30U         // MUX18 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX19_S   6U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX19_M   0xC0U         // MUX19 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX20_S   8U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX20_M   0x300U        // MUX20 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX21_S   10U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX21_M   0xC00U        // MUX21 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX22_S   12U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX22_M   0x3000U       // MUX22 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX23_S   14U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX23_M   0xC000U       // MUX23 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX24_S   16U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX24_M   0x30000U      // MUX24 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX25_S   18U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX25_M   0xC0000U      // MUX25 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX26_S   20U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX26_M   0x300000U     // MUX26 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX27_S   22U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX27_M   0xC00000U     // MUX27 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX28_S   24U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX28_M   0x3000000U    // MUX28 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX29_S   26U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX29_M   0xC000000U    // MUX29 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX30_S   28U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX30_M   0x30000000U   // MUX30 Configuration for AUXSIG3 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG3MUX16TO31CFG_MUX31_S   30U
#define XBAR_AUXSIG3MUX16TO31CFG_MUX31_M   0xC0000000U   // MUX31 Configuration for AUXSIG3 of
                                                         // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG4MUX0TO15CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG4MUX0TO15CFG_MUX0_S    0U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX0_M    0x3U          // MUX0 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX1_S    2U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX1_M    0xCU          // MUX1 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX2_S    4U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX2_M    0x30U         // MUX2 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX3_S    6U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX3_M    0xC0U         // MUX3 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX4_S    8U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX4_M    0x300U        // MUX4 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX5_S    10U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX5_M    0xC00U        // MUX5 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX6_S    12U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX6_M    0x3000U       // MUX6 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX7_S    14U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX7_M    0xC000U       // MUX7 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX8_S    16U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX8_M    0x30000U      // MUX8 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX9_S    18U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX9_M    0xC0000U      // MUX9 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX10_S   20U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX10_M   0x300000U     // MUX10 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX11_S   22U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX11_M   0xC00000U     // MUX11 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX12_S   24U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX12_M   0x3000000U    // MUX12 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX13_S   26U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX13_M   0xC000000U    // MUX13 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX14_S   28U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX14_M   0x30000000U   // MUX14 Configuration for AUXSIG4 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG4MUX0TO15CFG_MUX15_S   30U
#define XBAR_AUXSIG4MUX0TO15CFG_MUX15_M   0xC0000000U   // MUX15 Configuration for AUXSIG4 of
                                                        // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG4MUX16TO31CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG4MUX16TO31CFG_MUX16_S   0U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX16_M   0x3U          // MUX16 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX17_S   2U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX17_M   0xCU          // MUX17 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX18_S   4U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX18_M   0x30U         // MUX18 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX19_S   6U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX19_M   0xC0U         // MUX19 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX20_S   8U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX20_M   0x300U        // MUX20 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX21_S   10U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX21_M   0xC00U        // MUX21 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX22_S   12U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX22_M   0x3000U       // MUX22 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX23_S   14U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX23_M   0xC000U       // MUX23 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX24_S   16U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX24_M   0x30000U      // MUX24 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX25_S   18U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX25_M   0xC0000U      // MUX25 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX26_S   20U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX26_M   0x300000U     // MUX26 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX27_S   22U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX27_M   0xC00000U     // MUX27 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX28_S   24U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX28_M   0x3000000U    // MUX28 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX29_S   26U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX29_M   0xC000000U    // MUX29 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX30_S   28U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX30_M   0x30000000U   // MUX30 Configuration for AUXSIG4 of
                                                         // CLB-XBAR
#define XBAR_AUXSIG4MUX16TO31CFG_MUX31_S   30U
#define XBAR_AUXSIG4MUX16TO31CFG_MUX31_M   0xC0000000U   // MUX31 Configuration for AUXSIG4 of
                                                         // CLB-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the AUXSIG5MUX0TO15CFG register
//
//*************************************************************************************************
#define XBAR_AUXSIG5MUX0TO15CFG_MUX0_S    0U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX0_M    0x3U          // MUX0 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX1_S    2U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX1_M    0xCU          // MUX1 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX2_S    4U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX2_M    0x30U         // MUX2 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX3_S    6U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX3_M    0xC0U         // MUX3 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX4_S    8U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX4_M    0x300U        // MUX4 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX5_S    10U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX5_M    0xC00U        // MUX5 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX6_S    12U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX6_M    0x3000U       // MUX6 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX7_S    14U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX7_M    0xC000U       // MUX7 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX8_S    16U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX8_M    0x30000U      // MUX8 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX9_S    18U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX9_M    0xC0000U      // MUX9 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX10_S   20U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX10_M   0x300000U     // MUX10 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX11_S   22U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX11_M   0xC00000U     // MUX11 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX12_S   24U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX12_M   0x3000000U    // MUX12 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX13_S   26U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX13_M   0xC000000U    // MUX13 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX14_S   28U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX14_M   0x30000000U   // MUX14 Configuration for AUXSIG5 of
                                                        // CLB-XBAR
#define XBAR_AUXSIG5MUX0TO15CFG_MUX15_S   30U
#define XBAR_AUXSIG5MUX0TO15CFG_MUX15_M   0xC0000000U   // MUX15 Configuration for AUXSIG5 of
                                                        // CLB-XBAR

